princeton/ipvs/results/timeseries/time-scales/2_X_max/single-backend/500ms-fluctuation/3mins-run/20ms-feedback/feedback-wlc/2222-seed/run/httperf_client_123.log
httperf --verbose --hog --timeout=50 --client=0/1 --server=172.16.116.116 --port=8080 --uri=/ --rate=16 --send-buffer=4096 --recv-buffer=16384 --num-conns=2880 --num-calls=1
httperf: maximum number of open descriptors = 65535
Maximum connect burst length: 1

Connection lifetime histogram (time in ms):
             :
            10.5 178
            11.5 707
            12.5 335
            13.5 238
            14.5 140
            15.5 173
            16.5 356
            17.5 280
            18.5 138
            19.5 83
            20.5 41
            21.5 35
            22.5 22
            23.5 10
            24.5 11
            25.5 5
            26.5 3
            27.5 2
            28.5 1
            29.5 2
             :
            31.5 2
            32.5 1
             :
            42.5 1
             :
            45.5 1
            46.5 1
             :
            63.5 1
             :
            70.5 1
             :
            88.5 1
             :
            90.5 1
             :
            94.5 1
            95.5 1
            96.5 1
             :
           101.5 1
             :
           117.5 1
             :
           119.5 1
           120.5 2
             :
           128.5 1
             :
           130.5 2
             :
           136.5 1
             :
           140.5 1
             :
           142.5 1
             :
           146.5 2
             :
           149.5 1
             :
           153.5 1
           154.5 1
             :
           162.5 1
             :
           167.5 1
           168.5 3
             :
           170.5 1
           171.5 1
           172.5 3
           173.5 2
             :
           176.5 1
           177.5 1
             :
           179.5 1
             :
           181.5 1
           182.5 3
           183.5 1
           184.5 1
             :
           189.5 2
           190.5 1
             :
           193.5 1
             :
           198.5 1
             :
           200.5 1
             :
           204.5 1
             :
           206.5 1
             :
           208.5 2
             :
           212.5 1
           213.5 2
           214.5 1
             :
           216.5 1
             :
           222.5 1
             :
           225.5 2
           226.5 1
             :
           228.5 1
             :
           230.5 1
             :
           232.5 2
             :
           234.5 1
             :
           236.5 1
             :
           238.5 2
           239.5 1
             :
           244.5 2
           245.5 1
             :
           247.5 1
             :
           249.5 1
             :
           251.5 1
           252.5 2
             :
           255.5 1
             :
           258.5 1
             :
           260.5 1
             :
           262.5 2
           263.5 1
             :
           266.5 2
           267.5 1
           268.5 1
           269.5 2
             :
           271.5 1
           272.5 1
           273.5 1
             :
           277.5 1
             :
           281.5 2
             :
           284.5 1
           285.5 1
             :
           289.5 1
             :
           299.5 2
             :
           308.5 1
             :
           313.5 1
             :
           316.5 3
             :
           318.5 2
             :
           328.5 1
           329.5 1
             :
           335.5 1
             :
           350.5 1

Total: connections 2880 requests 2880 replies 2880 test-duration 179.952 s

Connection rate: 16.0 conn/s (62.5 ms/conn, <=3 concurrent connections)
Connection time [ms]: min 10.2 avg 22.4 max 350.8 median 13.5 stddev 41.0
Connection time [ms]: connect 0.8
Connection length [replies/conn]: 1.000

Request rate: 16.0 req/s (62.5 ms/req)
Request size [B]: 67.0

Reply rate [replies/s]: min 15.0 avg 16.0 max 17.0 stddev 0.4 (179 samples)
Percentages of the replies served at a given rate:
   50%: 15
   66%: 15
   75%: 15
   80%: 15
   90%: 16
   95%: 16
   98%: 16
   99%: 16
  100%: 17

Reply time [ms]: response 20.4 transfer 1.1
Percentages of the requests served within a certain time (ms) :
   50%: 12
   66%: 15
   75%: 15
   80%: 16
   90%: 17
   95%: 20
   98%: 196
   99%: 246
  100%: 329

Reply size [B]: header 162.0 content 72.0 footer 1.0 (total 235.0)
Reply status: 1xx=0 2xx=2880 3xx=0 4xx=0 5xx=0

CPU time [s]: user 149.53 system 30.08 (user 83.1% system 16.7% total 99.8%)
Net I/O: 4.7 KB/s (0.0*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0